In [1]:
## enumerate함수 : 열거하다
## 많은 양의 데이터인 list를 다룰 때 편리하게 쓸 수 있는 기능을 제공
## for~each, for
# for x in list: 리스트에 있는 것을 하나씩 꺼내서 처리하기가 아주 간단
#                index가 없어서 불편!
#                하나씩 꺼내서 출력, 연산하기는 용이
#                리스트에 입력은 안된다.!
#for i inrange(n): 리스트의 입력과 출력이 모두 됨
#                  인덱스로 리스트에 있는 값들을 접근해야하기 때문에
#                  코드가 복잡하게 보인다.

In [12]:
num_list=[100, 200, 300]

In [13]:
for x in num_list:
    print(x+100)

200
300
400

In [14]:
for x in enumerate(num_list):
    print(x)

(0, 100)
(1, 200)
(2, 300)

In [15]:
for i,x in enumerate(num_list):
    print(i,':', x)

0 : 100
1 : 200
2 : 300

In [16]:
for i,x in enumerate(num_list):
    num_list[i]=x+100

In [17]:
num_list

[200, 300, 400]

In [18]:
from sklearn.model_selection import KFold

In [19]:
kfold=KFold(n_splits=5)

In [30]:
import pandas as pd

In [36]:
titanic=pd.read_csv('titanic_train.csv')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,2,1,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,3,1,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,3,0,"Davies, Mr. Joseph",male,17.0,2,0,A/4 48873,8.0500,NaN,S,NaN,"West Bromwich, England Pontiac, MI"
894,3,0,"Lockyer, Mr. Edward",male,NaN,0,0,1222,7.8792,NaN,S,153.0,NaN
895,1,0,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,3,1,"Dorking, Mr. Edward Arthur",male,19.0,0,0,A/5. 10482,8.0500,NaN,S,NaN,"England Oglesby, IL"
897,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [37]:
## 함수(drop처리)
## name, ticket, body, home.dest

In [38]:
## 함수(na처리)
## na처리
## age는 평균으로 채워주세요
## cabin N으로 채워주세요.
## emberked는 N으로 채워주세요.(fillna())
## na개수가 몇개인지 전체 카운트